# Strings

In [51]:
import pandas as pd

__Ejercicio 1:__

Guardar la lista anterior en una serie llamada numeros

In [52]:
lista=[10,22,21]

In [53]:
serie=pd.Series(lista)
serie

0    10
1    22
2    21
dtype: int64

Convertir el tipo de dato en la serie anterior a String

In [54]:
serie.map(str)

0    10
1    22
2    21
dtype: object

In [55]:
serie.astype("string")

0    10
1    22
2    21
dtype: string

__Ejercicio 2:__

In [57]:
lista=["Daniel Israel","Rocio del Carmen","Paulina Isabelle", "Elias Israel"]

Guardar la lista anterior en una serie llamada __"nombres"__

In [58]:
nombres=pd.Series(lista)
nombres

0       Daniel Israel
1    Rocio del Carmen
2    Paulina Isabelle
3        Elias Israel
dtype: object

Obtener la longitud de todos los nombres (Ej. Pedro=5)

In [68]:
nombres.str.len()

0    13
1    16
2    16
3    12
dtype: int64

Cambiar todas las letras en los nombres a minuscula

In [69]:
nombres.str.lower()

0       daniel israel
1    rocio del carmen
2    paulina isabelle
3        elias israel
dtype: object

Cambiar todas las letras en los nombres a mayúscula

In [70]:
nombres.str.upper()

0       DANIEL ISRAEL
1    ROCIO DEL CARMEN
2    PAULINA ISABELLE
3        ELIAS ISRAEL
dtype: object

__Ejercicio 3:__

Cambiar la primera letra de cada palabra a mayúscula

In [65]:
nombres.str.title()

0       Daniel Israel
1    Rocio Del Carmen
2    Paulina Isabelle
3        Elias Israel
dtype: object

Cambiar la primera letra de cada registro a mayúscula (Ej. manuel jesus= Manuel jesus)

In [67]:
nombres.str.capitalize()

0       Daniel israel
1    Rocio del carmen
2    Paulina isabelle
3        Elias israel
dtype: object

__Ejercicio 4:__ Obtener la cantidad de veces que se repite la letra "a" en cada nombre

In [74]:
nombres.str.count("D")

0    1
1    0
2    0
3    0
dtype: int64

In [73]:
nombres

0       Daniel Israel
1    Rocio del Carmen
2    Paulina Isabelle
3        Elias Israel
dtype: object

__Ejercicio 5:__ Evaluar si los nombres anteriores empiezan con la cadena de caracteres "Daniel"

In [81]:
nombres.str.match("\waulina")

0    False
1    False
2    False
3    False
dtype: bool

__Ejercicio 6:__ Evaluar si los nombres contienen la cadena de caracteres "Israel"

In [84]:
nombres.str.contains("Israel")

0     True
1    False
2    False
3     True
dtype: bool

__Ejercicio 7:__

Crear una serie llamada __apellidos__ en base a la siguiente lista:

In [85]:
lista=["Romero","Aguilar","Mejia","Rojas"]

In [87]:
apellidos=pd.Series(lista)
apellidos

0     Romero
1    Aguilar
2      Mejia
3      Rojas
dtype: object

Evaluar si los apellidos empiezan por la letra "R"

In [94]:
apellidos.str.startswith("\wom")

0    False
1    False
2    False
3    False
dtype: bool

In [93]:
apellidos.str.match("\wom")

0     True
1    False
2    False
3    False
dtype: bool

Evaluar si los apellidos terminan por la letra "a"

In [96]:
apellidos.str.endswith("a")

0    False
1    False
2     True
3    False
dtype: bool

Obtener una serie nueva únicamente con los apellidos que terminan con la letra "a"

In [97]:
apellidos[apellidos.str.endswith("a")]

2    Mejia
dtype: object

__Ejercicio 8:__ Concatenar las serie con los nombres y los apellidos

In [102]:
nombres.str.cat(apellidos,sep=", ")

0        Daniel Israel, Romero
1    Rocio del Carmen, Aguilar
2      Paulina Isabelle, Mejia
3          Elias Israel, Rojas
dtype: object

In [105]:
nombres+" "+ apellidos

0        Daniel Israel Romero
1    Rocio del Carmen Aguilar
2      Paulina Isabelle Mejia
3          Elias Israel Rojas
dtype: object

__Ejercicio 9:__ Obtener las 3 primeras letras de los apellidos

In [107]:
apellidos.str.slice(start=0, stop=3)

0    Rom
1    Agu
2    Mej
3    Roj
dtype: object

In [108]:
apellidos

0     Romero
1    Aguilar
2      Mejia
3      Rojas
dtype: object

__Ejercicio 10:__ Obtener las 3 primeras letras de los apellidos y agregar un punto al final

In [114]:
apellidos.str.slice_replace(start=3, repl=" ")

0    Rom
1    Agu
2    Mej
3    Roj
dtype: object

__Ejercicio 11:__

In [115]:
lista=["171","Daniel","Romero","23","True"]

Guardar la lista anterior en una serie llamada "datos"

In [117]:
datos=pd.Series(lista)
datos

0       171
1    Daniel
2    Romero
3        23
4      True
dtype: object

Evaluar cuales de los datos en la serie anterior pueden transformarse a numeros

In [118]:
datos.str.isdecimal()

0     True
1    False
2    False
3     True
4    False
dtype: bool

Obtener una serie nueva únicamente con los registros númericos dentro de "datos"

In [123]:
datos[datos.str.isdecimal()].apply(int)

0    171
3     23
dtype: int64

Unir todos los datos de la serie "datos" en un único string

In [125]:
datos.str.cat(sep=" ")

'171 Daniel Romero 23 True'

__Ejercicio 12:__

In [126]:
lista=["12-12-2020","08-11-2021","15-01-2019"]

Guardar la lista anterior en una serie llamada fechas

Reemplazar los separadores "-" por "/" en las fechas anteriores (Ej. "12-12-2020" ="12/12/2020")

__Ejercicio 13:__ Separar la fecha en dia, mes y año, utilizando la función split

__Ejercicio 14:__ Obtener el año de cada fecha

In [133]:
fechas.str.split("-").str.get(2)

0    2020
1    2021
2    2019
dtype: object

__Ejercicio 15:__ Generar un DataFrane a partir de la serie fechas, utilizando la funcion split

In [135]:
fechas_df=fechas.str.split("-",expand=True)
fechas_df

    0   1     2
0  12  12  2020
1  08  11  2021
2  15  01  2019

In [138]:
fechas_df.columns=["dia","mes","año"]
fechas_df

  dia mes   año
0  12  12  2020
1  08  11  2021
2  15  01  2019

__Ejercicio 16:__

In [148]:
lista=["Raul Jose","Sofía Yasmin","Julia Carmen", "Roberto Miguel"]

Guardar la lista anterior en una serie llamada nombres

In [149]:
nombres=pd.Series(lista)
nombres

0         Raul Jose
1      Sofía Yasmin
2      Julia Carmen
3    Roberto Miguel
dtype: object

Cambiar a letras minusculas los nombres que terminen en la letra "n"

In [150]:
nombres[nombres.str.endswith("n")]=nombres[nombres.str.endswith("n")].str.lower()
nombres

0         Raul Jose
1      sofía yasmin
2      julia carmen
3    Roberto Miguel
dtype: object

Cambiar a letras mayusculas los nombres que empiecen con la letra "R"

In [153]:
nombres[nombres.str.startswith("R")]=nombres[nombres.str.startswith("R")].str.upper()
nombres

0         RAUL JOSE
1      sofía yasmin
2      julia carmen
3    ROBERTO MIGUEL
dtype: object

__Ejercicio 17:__

Importar los datos del archivo "mascotas.xlsx" utilizando pandas y guardarlos en un DataFrame llamado "mascotas"

In [156]:
mascotas=pd.read_excel("./mascotas.xlsx")
mascotas.head()

  nombre   tipo
0   Nala  Perro
1   Lola  Perro
2  Bella  Perro
3  Linda   Gato
4  Kiara  Perro

Cambiar las letras a mayusculas en el dato de la columna "tipo" si contiene la silaba "rro"

In [162]:
mascotas.tipo[mascotas.tipo.str.contains("rro")]=mascotas.tipo[mascotas.tipo.str.contains("rro")].str.upper()
mascotas

     nombre   tipo
0      Nala  PERRO
1      Lola  PERRO
2     Bella  PERRO
3     Linda   Gato
4     Kiara  PERRO
5      Luna   Gato
6      Nina  PERRO
7      Gala   Gato
8       Max  PERRO
9       Leo  PERRO
10    Rocky   Gato
11     Toby   Gato
12    Bruno   Gato
13     Otto  PERRO
14    Greta  PERRO
15     Milo  PERRO
16    Bruce  PERRO
17      Sam   Gato
18    Buddy   Gato
19      Gus  PERRO
20   Charly   Gato
21      Tom   Gato
22    Elvis   Gato
23     Luca   Gato
24      Rex   Gato
25    Bobby  PERRO
26  Chester  PERRO
27    Teddy  PERRO
28   Marley  PERRO
29   Copito   Gato
30    Betsy  PERRO
31    Perri  PERRO
32      Amy  PERRO

__Ejercicio 18:__ Cambiar las letras a minusculas en el dato de la columna "tipo" si empieza con la silaba "Ga"

In [166]:
mascotas.tipo[mascotas.tipo.str.startswith("Ga")]=mascotas.tipo[mascotas.tipo.str.startswith("Ga")].str.lower()

In [167]:
mascotas

     nombre   tipo
0      Nala  PERRO
1      Lola  PERRO
2     Bella  PERRO
3     Linda   gato
4     Kiara  PERRO
5      Luna   gato
6      Nina  PERRO
7      Gala   gato
8       Max  PERRO
9       Leo  PERRO
10    Rocky   gato
11     Toby   gato
12    Bruno   gato
13     Otto  PERRO
14    Greta  PERRO
15     Milo  PERRO
16    Bruce  PERRO
17      Sam   gato
18    Buddy   gato
19      Gus  PERRO
20   Charly   gato
21      Tom   gato
22    Elvis   gato
23     Luca   gato
24      Rex   gato
25    Bobby  PERRO
26  Chester  PERRO
27    Teddy  PERRO
28   Marley  PERRO
29   Copito   gato
30    Betsy  PERRO
31    Perri  PERRO
32      Amy  PERRO